Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпДлительностьЗвонка</Name>
					<Comment>Длительность звонка в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпСостояниеЗвонка</Name>
					<Comment>Состояние звонка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.сфпСостоянияЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/сфпИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>сфпИсторияЗвонков</Name>
			<Comment>История звонков СофтФон</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Comment>Дата ответа на звонок</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Звонок</Name>
					<Comment>Телефонный звонок</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/сфпСостоянияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>сфпСостоянияЗвонков</Name>
			<Comment>Состояния звонков СофтФон</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отвеченный</Name>
					<Comment>На звонок ответили</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущенный</Name>
					<Comment>На звонок не ответили</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТелефонныйЗвонок/Forms/сфпФормаДокумента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ.

// В этой конфигурации CoMagic не используется

//&НаСервере
//// Процедура пытается найти контакт по ID CoMagic и заполнить в Событии.
////
//// Параметры:
////	Нет.
////
//Процедура сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()
//	Контакт = сфпСофтФонПроСервер.сфпНайтиКонтактПоIDИзCoMagic(сфпСтруктураВнешнихДанных.comagic_context.visitor_id);
//	Если ЗначениеЗаполнено(Контакт) Тогда
//		Объект.АбонентКонтакт = Контакт.Ссылка;
//	КонецЕсли;
//КонецПроцедуры // сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()	

&НаСервере
// Процедура заполняет таблицу истории звонка.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьИсториюЗвонка()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Звонок", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаОтвета,
	               |	РегистрСведенийсфпИсторияЗвонков.ВнутреннийНомер,
	               |	ВЫБОР
	               |		КОГДА РегистрСведенийсфпИсторияЗвонков.ДатаОтвета = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, ДЕНЬ), СЕКУНДА, РАЗНОСТЬДАТ(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, РегистрСведенийсфпИсторияЗвонков.ДатаОкончания, СЕКУНДА))
	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, ДЕНЬ), СЕКУНДА, РАЗНОСТЬДАТ(РегистрСведенийсфпИсторияЗвонков.ДатаОтвета, РегистрСведенийсфпИсторияЗвонков.ДатаОкончания, СЕКУНДА))
	               |	КОНЕЦ КАК Длительность,
	               |	РегистрСведенийсфпИсторияЗвонков.ИдентификаторЗаписи,
	               |	РегистрСведенийсфпИсторияЗвонков.Ответственный,
	               |	РегистрСведенийсфпИсторияЗвонков.Входящий,
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаОкончания,
	               |	РегистрСведенийсфпИсторияЗвонков.НомерТелефона,
	               |	РегистрСведенийсфпИсторияЗвонков.Звонок,
	               |	РегистрСведенийсфпИсторияЗвонков.ИдентификаторЗвонка
	               |ИЗ
	               |	РегистрСведений.сфпИсторияЗвонков КАК РегистрСведенийсфпИсторияЗвонков
	               |ГДЕ
	               |	РегистрСведенийсфпИсторияЗвонков.Звонок = &Звонок
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала";
	сфпИсторияЗвонка.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = сфпИсторияЗвонка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	КоличествоЗвонковИстории = сфпИсторияЗвонка.Количество();
	Если КоличествоЗвонковИстории = 2 Тогда
		ТекЗвонок = сфпИсторияЗвонка[КоличествоЗвонковИстории-2].Звонок;
		Если ТекЗвонок.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный Тогда
			ТекЗвонок = сфпИсторияЗвонка[КоличествоЗвонковИстории-1].Звонок;
			Если ТекЗвонок.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный 
			И НЕ Объект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный Тогда
				Объект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьИсториюЗвонка()

&НаКлиенте
// Процедура заполняет значения реквизитов истории звонка.
//
// Параметры:
//	Нет.
//
Процедура УстановитьДоступностьРеквизитовЗвонка()
	Элементы.ПредыдущаяЗапись.Доступность	= Ложь;
	Элементы.СледущаяЗапись.Доступность		= Ложь;
	Элементы.ОписаниеЗвонка.Гиперссылка		= Ложь;
	КоличествоСтрок = сфпИсторияЗвонка.Количество();
	Если КоличествоСтрок > 0 Тогда
		Если КоличествоСтрок > 1 Тогда
			Элементы.ОписаниеЗвонка.Гиперссылка = Истина;
		КонецЕсли;	
		Если сфпНомерСтроки > 0 Тогда
			Элементы.ПредыдущаяЗапись.Доступность = Истина;
		КонецЕсли;
		Если сфпНомерСтроки < КоличествоСтрок - 1 Тогда
			Элементы.СледущаяЗапись.Доступность	= Истина;
		КонецЕсли;
		Элементы.ОписаниеЗвонка.Заголовок = Нстр("ru='Разговор ('") + Строка(сфпНомерСтроки + 1) + Нстр("ru=' из '") + Строка(КоличествоСтрок) + ") ";
		Если ПустаяСтрока(сфпИсторияЗвонка[сфпНомерСтроки].ИдентификаторЗаписи) Тогда
			Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
				Элементы.ПрослушатьЗаписьРазговора.Видимость = Истина;
			Иначе	
				Элементы.ПрослушатьЗаписьРазговора.Видимость = Ложь;
			КонецЕсли;	
		Иначе
			Элементы.ПрослушатьЗаписьРазговора.Видимость = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // УстановитьДоступностьРеквизитовЗвонка()

&НаКлиенте
// Процедура заполняет значения реквизитов истории звонка.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьЗначенияРеквизитовЗвонка()
	КоличествоСтрок = сфпИсторияЗвонка.Количество();
	Если (КоличествоСтрок > 0) И (сфпНомерСтроки < КоличествоСтрок) Тогда
		сфпОтветственный		= сфпИсторияЗвонка[сфпНомерСтроки].Ответственный;
		сфпЛиния				= сфпИсторияЗвонка[сфпНомерСтроки].ВнутреннийНомер;
		сфпДатаОтвета			= сфпИсторияЗвонка[сфпНомерСтроки].ДатаОтвета;
		сфпДлительностьЗвонка	= сфпИсторияЗвонка[сфпНомерСтроки].Длительность;
		Если (КоличествоСтрок = 1) И (сфпДлительностьЗвонка = Дата('00010101')) Тогда
			сфпДлительностьЗвонка	= сфпДлительность;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьЗначенияРеквизитовЗвонка()

&НаКлиенте
// Процедура - обработчик выбора разговора из меню.
//
// Параметры:
//	ВыбранныйЭлемент		- ЭлементСпискаЗначений	- Выбранный разговор.
//	ДополнительныеПараметры	- Структура				- Структура дополнительных параметров.
//
Процедура ОбработкаВыбораРазговора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	сфпНомерСтроки	= ВыбранныйЭлемент.Значение;	
	ЗаполнитьЗначенияРеквизитовЗвонка();
	УстановитьДоступностьРеквизитовЗвонка();
КонецПроцедуры // ОбработкаВыбораРазговора()	

&НаСервере
// Процедура управляет видимостью кнопок "Создать Партнера" и "Добавить телефон"
//
Процедура сфпУправлениеВидомостьюКнопокДобавления()
	Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		Элементы.СоздатьКонтакт.Видимость = Истина;
	Иначе
		Элементы.СоздатьКонтакт.Видимость = Ложь;
	КонецЕсли;		
	Элементы.ДобавитьТелефон.Видимость = сфпСофтФонПроСервер.сфпПроверитьНаличиеНомераТелефонаУАбонента(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
КонецПроцедуры

&НаСервере
Процедура сфпРазрешеныИзмененияВДокументе()
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	Если ТекПользователь <> Объект.Ответственный И Не (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("сфпУправлениеМаршрутизацией")) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ОписаниеЗвонка".
//
Процедура ОписаниеЗвонкаНажатие(Элемент)
	СписокРазговоров = Новый СписокЗначений;
	текНомерСтроки = 0;
	Для Каждого СтрокаЗвонка Из сфпИсторияЗвонка Цикл
		ОписаниеРазговора = Строка(текНомерСтроки + 1) + ". " + Строка(СтрокаЗвонка.Ответственный) 
		+ " (" + Строка(СтрокаЗвонка.ВнутреннийНомер) + "): " 
		+ Формат(СтрокаЗвонка.Длительность, "ДЛФ=T; ДП=0:00:00");
		Если ПустаяСтрока(СтрокаЗвонка.ИдентификаторЗаписи) Тогда
			Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
				СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора, , БиблиотекаКартинок.ЖурналРегистрации);
			Иначе	
				СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора);
			КонецЕсли;	
		Иначе
			СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора, , БиблиотекаКартинок.ЖурналРегистрации);
		КонецЕсли;	
	КонецЦикла;	
	ВыбранныйЭлемент = ВыбратьИзМеню(СписокРазговоров, Элемент);
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	сфпНомерСтроки	= ВыбранныйЭлемент.Значение;	
	ЗаполнитьЗначенияРеквизитовЗвонка();
	УстановитьДоступностьРеквизитовЗвонка();	
КонецПроцедуры // ОписаниеЗвонкаНажатие()

&НаКлиенте
Процедура АбонентКонтактПриИзменении(Элемент)
	сфпУправлениеВидомостьюКнопокДобавления();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ.

&НаКлиенте
// Процедура - обработчик команды формы "ПредыдущаяЗапись".
//
Процедура ПредыдущаяЗапись(Команда)
	Если сфпНомерСтроки > 0 Тогда
		сфпНомерСтроки = сфпНомерСтроки - 1;
		ЗаполнитьЗначенияРеквизитовЗвонка();
	КонецЕсли;
КонецПроцедуры // ПредыдущаяЗапись()

&НаКлиенте
// Процедура - обработчик команды формы "ПрослушатьЗаписьРазговора".
//
Процедура ПрослушатьЗаписьРазговора(Команда)
	ТД = сфпИсторияЗвонка[сфпНомерСтроки];
	// Прежде, чем искать запись мы должны выяснить, есть ли права на прослушку у данного пользователя
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	МассивПрослушиваемыхПользователей = сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(ТекПользователь);
	Если МассивПрослушиваемыхПользователей.Количество() > 0 Тогда
		Если МассивПрослушиваемыхПользователей.Найти(Объект.Ответственный) = Неопределено Тогда
			ТекстПредупреждения = Нстр("ru = 'У данного пользователя нет прав на прослушивание разговора пользователя '") + """" + Строка(Объект.Ответственный) + """" + ".";
			ПоказатьПредупреждение(,ТекстПредупреждения);
			Возврат;
		КонецЕсли;					
	Иначе				
		ТекстПредупреждения = Нстр("ru = 'У данного пользователя нет прав на прослушивание разговора пользователя '") + """" + Строка(Объект.Ответственный) + """" + ".";
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;				
	Если ПустаяСтрока(ТД.ИдентификаторЗаписи) Тогда
		Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
			Если ТД.Входящий Тогда
				ТелефонА	= ТД.НомерТелефона;
				ТелефонБ	= ТД.ВнутреннийНомер;
			Иначе
				ТелефонА	= ТД.ВнутреннийНомер;
				ТелефонБ	= ТД.НомерТелефона;						
			КонецЕсли;
			// Выполняем поиск записи разговора
			НайденнаяЗапись = сфпСофтФонПроКлиент.сфпНайтиЗаписьРазговораCLON(ТелефонА, ТелефонБ,  ТД.ДатаНачала, ТД.ДатаОкончания, ТД.Входящий); 
			Если НЕ (НайденнаяЗапись = Неопределено) Тогда
				// Запускаем запись на прослушивание
				сфпСофтФонПроКлиент.сфпПолучитьФайлРазговора(НайденнаяЗапись.file);
				// Записываем в регистр идентификатор записи
				сфпСофтФонПроСервер.сфпЗаписатьИдентификаторЗаписиВРегистр(ТД.Звонок, ТД.ИдентификаторЗвонка, НайденнаяЗапись.file);
				// Обновляем историю звонка
				ЗаполнитьИсториюЗвонка();
				ЗаполнитьЗначенияРеквизитовЗвонка();
				УстановитьДоступностьРеквизитовЗвонка();
			КонецЕсли;
		КонецЕсли;	
	Иначе
		сфпСофтФонПроКлиент.сфпПолучитьФайлРазговора(ТД.ИдентификаторЗаписи)
	КонецЕсли;	
КонецПроцедуры // ПрослушатьЗаписьРазговора()

&НаКлиенте
// Процедура - обработчик команды формы "СледущаяЗапись".
//
Процедура СледущаяЗапись(Команда)
	КоличествоСтрок = сфпИсторияЗвонка.Количество() - 1;
	Если сфпНомерСтроки < КоличествоСтрок Тогда
		сфпНомерСтроки = сфпНомерСтроки + 1;
		ЗаполнитьЗначенияРеквизитовЗвонка();
		УстановитьДоступностьРеквизитовЗвонка();
	КонецЕсли;
КонецПроцедуры // СледущаяЗапись()

&НаКлиенте
Процедура сфпЗагрузитьИсториюЗвонков(Команда)
	Если НЕ сфпСофтФонПроСервер.сфпРолиДоступны("ПолныеПрава, сфпУправлениеМаршрутизацией") Тогда
		Сообщить(НСтр("ru='Недостаточно прав для загрузки истории звонков!'"));
		Возврат;
	КонецЕсли;
	сфпСофтФонПроСервер.сфпПолучитьИсториюЗвонков(Новый Структура());
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСобытиеНаОсновании(Команда)
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьТелефон".
//
Процедура ДобавитьТелефон(Команда)
	ДобавитьТелефонНаСервер(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
	Элементы.ДобавитьТелефон.Видимость = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура добавляет номер телефона из поля "Как связаться" в объект из поля "Контакт"
//
//   Параметры:
//    СсылкаКИ 		- СправочникСсылка 	- Объект, к которому добавляется телефон
//	  НомерТелефона - Строка			- Добавляемый номер телефона
//
Процедура ДобавитьТелефонНаСервер(СсылкаКИ, НомерТелефона)
	НомерТелефона = СокрЛП(НомерТелефона);
	Если ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(СсылкаКИ);
		НаборЗаписейКИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		НаборЗаписейКИ.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		НоваяЗапись 		= НаборЗаписейКИ.Добавить();
		НоваяЗапись.Вид    	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
		НоваяЗапись.Тип    	= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект 	= СсылкаКИ;
		НоваяЗапись.Поле1  	= СтруктураНомера.КодСтраны;
		НоваяЗапись.Поле3  	= СтруктураНомера.НомерТелефона;
		НоваяЗапись.Поле4  	= СтруктураНомера.Внутренний;
		НоваяЗапись.Поле2  	= СтруктураНомера.КодГорода;
		сфпСофтФонПроСервер.сфпСформироватьПредставлениеТелефонаИзНабораПолей(НоваяЗапись);
		НаборЗаписейКИ.Записать();
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Организации") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(СсылкаКИ);
		НаборЗаписейКИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		НаборЗаписейКИ.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		НоваяЗапись 		= НаборЗаписейКИ.Добавить();
		НоваяЗапись.Вид    	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
		НоваяЗапись.Тип    	= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект 	= СсылкаКИ;
		НоваяЗапись.Поле1  	= СтруктураНомера.КодСтраны;
		НоваяЗапись.Поле3  	= СтруктураНомера.НомерТелефона;
		НоваяЗапись.Поле4  	= СтруктураНомера.Внутренний;
		НоваяЗапись.Поле2  	= СтруктураНомера.КодГорода;
		сфпСофтФонПроСервер.сфпСформироватьПредставлениеТелефонаИзНабораПолей(НоваяЗапись);
		НаборЗаписейКИ.Записать();		
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
		Иначе
			ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
		КонецЕсли;
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(СсылкаКИ);
		НаборЗаписейКИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		НаборЗаписейКИ.Отбор.Вид.Установить(ВидТелефона);
		НоваяЗапись 		= НаборЗаписейКИ.Добавить();
		НоваяЗапись.Вид    	= ВидТелефона;
		НоваяЗапись.Тип    	= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект 	= СсылкаКИ;
		НоваяЗапись.Поле1  	= СтруктураНомера.КодСтраны;
		НоваяЗапись.Поле3  	= СтруктураНомера.НомерТелефона;
		НоваяЗапись.Поле4  	= СтруктураНомера.Внутренний;
		НоваяЗапись.Поле2  	= СтруктураНомера.КодГорода;
		сфпСофтФонПроСервер.сфпСформироватьПредставлениеТелефонаИзНабораПолей(НоваяЗапись);
		НаборЗаписейКИ.Записать();
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
		Иначе
			ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
		КонецЕсли;			
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(СсылкаКИ);
		НаборЗаписейКИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		НаборЗаписейКИ.Отбор.Вид.Установить(ВидТелефона);
		НоваяЗапись 		= НаборЗаписейКИ.Добавить();
		НоваяЗапись.Вид    	= ВидТелефона;
		НоваяЗапись.Тип    	= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект 	= СсылкаКИ;
		НоваяЗапись.Поле1  	= СтруктураНомера.КодСтраны;
		НоваяЗапись.Поле3  	= СтруктураНомера.НомерТелефона;
		НоваяЗапись.Поле4  	= СтруктураНомера.Внутренний;
		НоваяЗапись.Поле2  	= СтруктураНомера.КодГорода;
		сфпСофтФонПроСервер.сфпСформироватьПредставлениеТелефонаИзНабораПолей(НоваяЗапись);
		НаборЗаписейКИ.Записать();
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик команды формы "СоздатьПартнера".
//
Процедура СоздатьКонтакт(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"), Нстр("ru = 'Контрагент'"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"), Нстр("ru = 'Сотрудник'"));	
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка"), Нстр("ru = 'Подразделение компании'"));		
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"), Нстр("ru = 'Организация'"));	
	
	ВыбранныйЭлемент = ВыбратьИзМеню(СписокВыбора, Элементы.АбонентКонтакт);
	СоздатьПартнераПослеВыбораТипаКонтакта(ВыбранныйЭлемент, Новый Структура());
	
КонецПроцедуры

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура СоздатьПартнераПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат КонецЕсли;
	Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Объект.АбонентКакСвязаться);
	Если ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
		ФормаКонтакта = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта",,ЭтаФорма);
		ФормаКонтакта.CRM_Основание = Объект.Ссылка;
		ФормаКонтакта.Открыть();
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ФормаКонтакта = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта",,ЭтаФорма);
		ФормаКонтакта.CRM_Основание = Объект.Ссылка;
		ФормаКонтакта.Открыть();
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда	
		ФормаКонтакта = ПолучитьФорму("Справочник.ПодразделенияКомпании.ФормаОбъекта",,ЭтаФорма);
		ФормаКонтакта.CRM_Основание = Объект.Ссылка;
		ФормаКонтакта.Открыть();
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Организации") Тогда
		ФормаКонтакта = ПолучитьФорму("Справочник.Организации.ФормаОбъекта",,ЭтаФорма);
		ФормаКонтакта.CRM_Основание = Объект.Ссылка;
		ФормаКонтакта.Открыть();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор			= сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Ответственный	= сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Дата				= сфпСофтФонПроСервер.сфпТекущаяДата();
		Объект.Важность			= Перечисления.Важность.Средняя;
	КонецЕсли;
	Если Параметры.Свойство("АбонентКонтакт") И ЗначениеЗаполнено(Параметры.АбонентКонтакт) Тогда
		Объект.АбонентКонтакт = Параметры.АбонентКонтакт;
		Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
	КонецЕсли;	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	сфпДлительность = Дата('00010101') + Объект.сфпДлительностьЗвонка;
	Заголовок = НСтр("ru='Звонок'");
	Если Объект.Входящий Тогда
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Заголовок = Заголовок + НСтр("ru=' входящий '") + "(" + НСтр("ru='пропущенный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = Нстр("ru = 'Состояние: пропущенный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Красный;
		Иначе	
			Заголовок = Заголовок + НСтр("ru=' входящий '") + "(" + НСтр("ru='отвеченный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = Нстр("ru = 'Состояние: отвеченный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;	
	Иначе
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Заголовок = Заголовок + НСтр("ru=' исходящий '") + "(" + НСтр("ru='не дозвонились'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = Нстр("ru = 'Состояние: не дозвонились'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Красный;
		Иначе	
			Заголовок = Заголовок + НСтр("ru=' исходящий '") + "(" + НСтр("ru='отвеченный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = Нстр("ru = 'Состояние: отвеченный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;	
	КонецЕсли;
	Заголовок = Заголовок + ", " + Объект.АбонентПредставление + ", " + Формат(Объект.Дата, "ДЛФ=D") + "/" 
		+ Формат(Объект.Дата, "ДЛФ=T; ДП=0:00:00") + "/" + Формат(Дата('00010101') + Объект.сфпДлительностьЗвонка, "ДЛФ=T; ДП=0:00:00");
	сфпНомерСтроки	= 0;	
	ЗаполнитьИсториюЗвонка();
	ЗаполнитьЗначенияРеквизитовЗвонка();
	УстановитьДоступностьРеквизитовЗвонка();
	сфпУправлениеВидомостьюКнопокДобавления();
	сфпРазрешеныИзмененияВДокументе();
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если (ИмяСобытия = "СофтФон_КонецРазговора") И Параметр.Свойство("Звонок") Тогда
		Если (Параметр.Звонок = Объект.Ссылка) Тогда
			Объект.сфпДлительностьЗвонка = сфпСофтФонПроСервер.сфпТекущаяДата() - Объект.Дата;
			сфпДлительность		= Дата('00010101') + Объект.сфпДлительностьЗвонка;
			Объект.Описание		= сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(Объект.сфпДлительностьЗвонка);
			Если Параметр.Свойство("НовыйОтветственный") Тогда
				Объект.Ответственный = Параметр.НовыйОтветственный;
			КонецЕсли;
			Модифицированность	= Истина;
			ЗаполнитьИсториюЗвонка();
			ЗаполнитьЗначенияРеквизитовЗвонка();
			УстановитьДоступностьРеквизитовЗвонка();
		КонецЕсли;
	ИначеЕсли (ИмяСобытия = "Софтфон_CoMagic") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Объект.Ссылка Тогда
			Если (Объект.сфпДлительностьЗвонка = 0) И (сфпСтруктураВнешнихДанных = Неопределено) Тогда
				// Заполняем документ данными из CoMagic
				сфпСтруктураВнешнихДанных	= Параметр.СтруктураCoMagic;
				Объект.сфпCoMagicID			= сфпСтруктураВнешнихДанных.comagic_context.visitor_id;
				Объект.Описание = Объект.Описание + ?(ПустаяСтрока(Объект.Описание), "", Символы.ПС) 
					+ НСтр("ru='Кампания: '") + сфпСтруктураВнешнихДанных.comagic_context.campaign + Символы.ПС 
					+ НСтр("ru='Сайт: '") + сфпСтруктураВнешнихДанных.comagic_context.site + Символы.ПС
					+ НСтр("ru='Ключевые слова: '") + сфпСтруктураВнешнихДанных.comagic_context.search_query; 
				// В этой конфигурации CoMagic не используется
				//Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
				//	сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic();
				//КонецЕсли;			
				Модифицированность	= Истина;
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли (ИмяСобытия = "ЗаполнитьКонтактВТелефонномЗвонке") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Объект.Ссылка Тогда
			Объект.АбонентКонтакт 				= Параметр.Контакт;
			Объект.АбонентПредставление 		= Строка(Объект.АбонентКонтакт);
			Элементы.СоздатьКонтакт.Видимость 	= Ложь;
			Модифицированность					= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
// Процедура - обработчик события формы "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// В этой конфигурации CoMagic не используется
	//Если НЕ ПустаяСтрока(Объект.сфпCoMagicID) Тогда
	//	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
	//		Если ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
	//			сфпСофтФонПроСервер.сфпЗаписатьIDCoMagic(Объект.АбонентКонтакт, Объект.сфпCoMagicID);
	//			Объект.сфпCoMagicID = "";
	//		ИначеЕсли ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
	//			сфпСофтФонПроСервер.сфпЗаписатьIDCoMagic(Объект.АбонентКонтакт, Объект.сфпCoMagicID);
	//			Объект.сфпCoMagicID = "";				
	//		ИначеЕсли ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
	//			сфпСофтФонПроСервер.сфпЗаписатьIDCoMagic(Объект.АбонентКонтакт, Объект.сфпCoMagicID);
	//			Объект.сфпCoMagicID = "";
	//		КонецЕсли;	
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры // ПослеЗаписи()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаЗаписиНового"
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Если ТипЗнч(Источник) = Тип("Форма") И Источник.ВладелецФормы = ЭтаФорма И НЕ (ТипЗнч(НовыйОбъект) = Тип("УправляемаяФорма")) Тогда
		Объект.АбонентКонтакт 				= НовыйОбъект.Ссылка;
		Объект.АбонентПредставление 		= Строка(Объект.АбонентКонтакт);
		Элементы.СоздатьКонтакт.Видимость 	= Ложь;
		Модифицированность					= Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
